load/telemetry/20260622T033037Z-docker/k6-run.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/ws_event_room.js
        output: json (/scripts/telemetry/20260622T033037Z-docker/k6-summary.json)

     scenarios: (100.00%) 1 scenario, 15000 max VUs, 4m0s max duration (incl. graceful stop):
              * sharded_room: Up to 15000 looping VUs for 3m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


Init           [   9% ] 01307/15000 VUs initialized
sharded_room   [   0% ]

Init           [  19% ] 02785/15000 VUs initialized
sharded_room   [   0% ]

Init           [  29% ] 04389/15000 VUs initialized
sharded_room   [   0% ]

Init           [  42% ] 06251/15000 VUs initialized
sharded_room   [   0% ]

Init           [  50% ] 07454/15000 VUs initialized
sharded_room   [   0% ]

Init           [  63% ] 09420/15000 VUs initialized
sharded_room   [   0% ]

Init           [  78% ] 11698/15000 VUs initialized
sharded_room   [   0% ]

Init           [  81% ] 12142/15000 VUs initialized
sharded_room   [   0% ]

Init           [  90% ] 13428/15000 VUs initialized
sharded_room   [   0% ]

running (0m00.4s), 00000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   0% ] 00000/15000 VUs  0m00.1s/3m30.0s

running (0m01.4s), 00285/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   1% ] 00285/15000 VUs  0m01.1s/3m30.0s

running (0m02.4s), 00536/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   1% ] 00536/15000 VUs  0m02.1s/3m30.0s

running (0m03.4s), 00786/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   1% ] 00786/15000 VUs  0m03.1s/3m30.0s

running (0m04.4s), 01035/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   2% ] 01035/15000 VUs  0m04.1s/3m30.0s

running (0m05.4s), 01285/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   2% ] 01285/15000 VUs  0m05.1s/3m30.0s

running (0m06.4s), 01535/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   3% ] 01535/15000 VUs  0m06.1s/3m30.0s

running (0m07.4s), 01786/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   3% ] 01786/15000 VUs  0m07.1s/3m30.0s

running (0m08.4s), 02035/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   4% ] 02035/15000 VUs  0m08.1s/3m30.0s

running (0m09.4s), 02285/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   4% ] 02285/15000 VUs  0m09.1s/3m30.0s

running (0m10.4s), 02535/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   5% ] 02535/15000 VUs  0m10.1s/3m30.0s

running (0m11.4s), 02785/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   5% ] 02785/15000 VUs  0m11.1s/3m30.0s

running (0m12.4s), 03035/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   6% ] 03035/15000 VUs  0m12.1s/3m30.0s

running (0m13.4s), 03285/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   6% ] 03285/15000 VUs  0m13.1s/3m30.0s

running (0m14.4s), 03535/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   7% ] 03535/15000 VUs  0m14.1s/3m30.0s

running (0m15.4s), 03785/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   7% ] 03785/15000 VUs  0m15.1s/3m30.0s

running (0m16.4s), 04035/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   8% ] 04035/15000 VUs  0m16.1s/3m30.0s

running (0m17.4s), 04285/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   8% ] 04285/15000 VUs  0m17.1s/3m30.0s

running (0m18.4s), 04536/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   9% ] 04536/15000 VUs  0m18.1s/3m30.0s

running (0m19.4s), 04785/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [   9% ] 04785/15000 VUs  0m19.1s/3m30.0s

running (0m20.4s), 05035/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  10% ] 05035/15000 VUs  0m20.1s/3m30.0s

running (0m21.4s), 05285/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  10% ] 05285/15000 VUs  0m21.1s/3m30.0s

running (0m22.4s), 05535/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  11% ] 05535/15000 VUs  0m22.1s/3m30.0s

running (0m23.4s), 05785/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  11% ] 05785/15000 VUs  0m23.1s/3m30.0s

running (0m24.3s), 06035/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  11% ] 06035/15000 VUs  0m24.1s/3m30.0s

running (0m25.3s), 06285/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  12% ] 06285/15000 VUs  0m25.1s/3m30.0s

running (0m26.3s), 06535/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  12% ] 06535/15000 VUs  0m26.1s/3m30.0s

running (0m27.3s), 06785/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  13% ] 06785/15000 VUs  0m27.1s/3m30.0s

running (0m28.3s), 07035/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  13% ] 07035/15000 VUs  0m28.1s/3m30.0s

running (0m29.3s), 07285/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  14% ] 07285/15000 VUs  0m29.1s/3m30.0s

running (0m30.3s), 07535/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  14% ] 07535/15000 VUs  0m30.1s/3m30.0s

running (0m31.3s), 07786/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  15% ] 07786/15000 VUs  0m31.1s/3m30.0s

running (0m32.3s), 08035/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  15% ] 08035/15000 VUs  0m32.1s/3m30.0s

running (0m33.3s), 08285/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  16% ] 08285/15000 VUs  0m33.1s/3m30.0s

running (0m34.3s), 08535/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  16% ] 08535/15000 VUs  0m34.1s/3m30.0s

running (0m35.3s), 08785/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  17% ] 08785/15000 VUs  0m35.1s/3m30.0s

running (0m36.3s), 09035/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  17% ] 09035/15000 VUs  0m36.1s/3m30.0s

running (0m37.3s), 09285/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  18% ] 09285/15000 VUs  0m37.1s/3m30.0s

running (0m38.3s), 09535/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  18% ] 09535/15000 VUs  0m38.1s/3m30.0s

running (0m39.3s), 09785/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  19% ] 09785/15000 VUs  0m39.1s/3m30.0s

running (0m40.3s), 10035/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  19% ] 10035/15000 VUs  0m40.1s/3m30.0s

running (0m41.3s), 10285/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  20% ] 10285/15000 VUs  0m41.1s/3m30.0s

running (0m42.3s), 10535/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  20% ] 10535/15000 VUs  0m42.1s/3m30.0s

running (0m43.3s), 10785/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  21% ] 10785/15000 VUs  0m43.1s/3m30.0s

running (0m44.3s), 11035/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  21% ] 11035/15000 VUs  0m44.1s/3m30.0s

running (0m45.2s), 11288/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  22% ] 11288/15000 VUs  0m45.2s/3m30.0s

running (0m46.2s), 11535/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  22% ] 11535/15000 VUs  0m46.1s/3m30.0s

running (0m47.2s), 11789/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  22% ] 11789/15000 VUs  0m47.2s/3m30.0s

running (0m48.2s), 12035/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  23% ] 12035/15000 VUs  0m48.1s/3m30.0s

running (0m49.2s), 12286/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  23% ] 12286/15000 VUs  0m49.2s/3m30.0s

running (0m50.2s), 12551/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  24% ] 12551/15000 VUs  0m50.2s/3m30.0s

running (0m51.3s), 12798/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  24% ] 12798/15000 VUs  0m51.2s/3m30.0s

running (0m52.2s), 13035/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  25% ] 13035/15000 VUs  0m52.1s/3m30.0s

running (0m53.2s), 13285/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  25% ] 13285/15000 VUs  0m53.2s/3m30.0s

running (0m54.2s), 13535/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  26% ] 13535/15000 VUs  0m54.1s/3m30.0s

running (0m55.2s), 13782/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  26% ] 13782/15000 VUs  0m55.1s/3m30.0s

running (0m56.2s), 14035/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  27% ] 14035/15000 VUs  0m56.1s/3m30.0s

running (0m57.2s), 14283/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  27% ] 14283/15000 VUs  0m57.1s/3m30.0s

running (0m58.2s), 14532/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  28% ] 14532/15000 VUs  0m58.2s/3m30.0s

running (0m59.2s), 14720/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  28% ] 14720/15000 VUs  0m59.2s/3m30.0s

running (1m00.2s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  29% ] 15000/15000 VUs  1m00.2s/3m30.0s

running (1m01.2s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  29% ] 15000/15000 VUs  1m01.1s/3m30.0s

running (1m02.2s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  30% ] 15000/15000 VUs  1m02.1s/3m30.0s

running (1m03.2s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  30% ] 15000/15000 VUs  1m03.1s/3m30.0s

running (1m04.2s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  31% ] 15000/15000 VUs  1m04.1s/3m30.0s

running (1m05.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  31% ] 15000/15000 VUs  1m05.1s/3m30.0s

running (1m06.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  31% ] 15000/15000 VUs  1m06.1s/3m30.0s

running (1m07.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  32% ] 15000/15000 VUs  1m07.1s/3m30.0s

running (1m08.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  32% ] 15000/15000 VUs  1m08.1s/3m30.0s

running (1m09.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  33% ] 15000/15000 VUs  1m09.1s/3m30.0s

running (1m10.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  33% ] 15000/15000 VUs  1m10.1s/3m30.0s

running (1m11.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  34% ] 15000/15000 VUs  1m11.1s/3m30.0s

running (1m12.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  34% ] 15000/15000 VUs  1m12.1s/3m30.0s

running (1m13.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  35% ] 15000/15000 VUs  1m13.1s/3m30.0s

running (1m14.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  35% ] 15000/15000 VUs  1m14.1s/3m30.0s

running (1m15.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  36% ] 15000/15000 VUs  1m15.1s/3m30.0s

running (1m16.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  36% ] 15000/15000 VUs  1m16.1s/3m30.0s

running (1m17.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  37% ] 15000/15000 VUs  1m17.1s/3m30.0s

running (1m18.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  37% ] 15000/15000 VUs  1m18.1s/3m30.0s

running (1m19.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  38% ] 15000/15000 VUs  1m19.1s/3m30.0s

running (1m20.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  38% ] 15000/15000 VUs  1m20.1s/3m30.0s

running (1m21.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  39% ] 15000/15000 VUs  1m21.1s/3m30.0s

running (1m22.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  39% ] 15000/15000 VUs  1m22.1s/3m30.0s

running (1m23.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  40% ] 15000/15000 VUs  1m23.1s/3m30.0s

running (1m24.1s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  40% ] 15000/15000 VUs  1m24.1s/3m30.0s

running (1m25.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  41% ] 15000/15000 VUs  1m25.1s/3m30.0s

running (1m26.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  41% ] 15000/15000 VUs  1m26.1s/3m30.0s

running (1m27.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  41% ] 15000/15000 VUs  1m27.1s/3m30.0s

running (1m28.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  42% ] 15000/15000 VUs  1m28.1s/3m30.0s

running (1m29.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  42% ] 15000/15000 VUs  1m29.1s/3m30.0s

running (1m30.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  43% ] 15000/15000 VUs  1m30.1s/3m30.0s

running (1m31.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  43% ] 15000/15000 VUs  1m31.1s/3m30.0s

running (1m32.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  44% ] 15000/15000 VUs  1m32.1s/3m30.0s

running (1m33.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  44% ] 15000/15000 VUs  1m33.1s/3m30.0s

running (1m34.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  45% ] 15000/15000 VUs  1m34.1s/3m30.0s

running (1m35.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  45% ] 15000/15000 VUs  1m35.1s/3m30.0s

running (1m36.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  46% ] 15000/15000 VUs  1m36.1s/3m30.0s

running (1m37.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  46% ] 15000/15000 VUs  1m37.1s/3m30.0s

running (1m38.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  47% ] 15000/15000 VUs  1m38.1s/3m30.0s

running (1m39.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  47% ] 15000/15000 VUs  1m39.1s/3m30.0s

running (1m40.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  48% ] 15000/15000 VUs  1m40.1s/3m30.0s

running (1m41.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  48% ] 15000/15000 VUs  1m41.1s/3m30.0s

running (1m42.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  49% ] 15000/15000 VUs  1m42.1s/3m30.0s

running (1m43.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  49% ] 15000/15000 VUs  1m43.1s/3m30.0s

running (1m44.0s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  50% ] 15000/15000 VUs  1m44.1s/3m30.0s

running (1m44.9s), 15000/15000 VUs, 0 complete and 0 interrupted iterations
sharded_room   [  50% ] 15000/15000 VUs  1m45.1s/3m30.0s

running (1m45.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  51% ] 15000/15000 VUs  1m46.1s/3m30.0s

running (1m46.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  51% ] 15000/15000 VUs  1m47.1s/3m30.0s

running (1m47.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  51% ] 15000/15000 VUs  1m48.1s/3m30.0s

running (1m48.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  52% ] 15000/15000 VUs  1m49.1s/3m30.0s

running (1m49.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  52% ] 15000/15000 VUs  1m50.1s/3m30.0s

running (1m50.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  53% ] 15000/15000 VUs  1m51.1s/3m30.0s

running (1m51.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  53% ] 15000/15000 VUs  1m52.1s/3m30.0s

running (1m52.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  54% ] 15000/15000 VUs  1m53.1s/3m30.0s

running (1m53.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  54% ] 15000/15000 VUs  1m54.1s/3m30.0s

running (1m54.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  55% ] 15000/15000 VUs  1m55.1s/3m30.0s

running (1m55.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  55% ] 15000/15000 VUs  1m56.1s/3m30.0s

running (1m56.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  56% ] 15000/15000 VUs  1m57.1s/3m30.0s

running (1m57.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  56% ] 15000/15000 VUs  1m58.1s/3m30.0s

running (1m58.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  57% ] 15000/15000 VUs  1m59.1s/3m30.0s

running (1m59.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  57% ] 15000/15000 VUs  2m00.1s/3m30.0s

running (2m00.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  58% ] 15000/15000 VUs  2m01.1s/3m30.0s

running (2m01.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  58% ] 15000/15000 VUs  2m02.1s/3m30.0s

running (2m02.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  59% ] 15000/15000 VUs  2m03.1s/3m30.0s

running (2m03.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  59% ] 15000/15000 VUs  2m04.1s/3m30.0s

running (2m04.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  60% ] 15000/15000 VUs  2m05.1s/3m30.0s

running (2m05.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  60% ] 15000/15000 VUs  2m06.1s/3m30.0s

running (2m06.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  61% ] 15000/15000 VUs  2m07.1s/3m30.0s

running (2m07.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  61% ] 15000/15000 VUs  2m08.1s/3m30.0s

running (2m08.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  61% ] 15000/15000 VUs  2m09.1s/3m30.0s

running (2m09.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  62% ] 15000/15000 VUs  2m10.1s/3m30.0s

running (2m10.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  62% ] 15000/15000 VUs  2m11.1s/3m30.0s

running (2m11.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  63% ] 15000/15000 VUs  2m12.1s/3m30.0s

running (2m12.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  63% ] 15000/15000 VUs  2m13.1s/3m30.0s

running (2m13.9s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  64% ] 15000/15000 VUs  2m14.1s/3m30.0s

running (2m14.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  64% ] 15000/15000 VUs  2m15.1s/3m30.0s

running (2m15.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  65% ] 15000/15000 VUs  2m16.1s/3m30.0s

running (2m16.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  65% ] 15000/15000 VUs  2m17.1s/3m30.0s

running (2m17.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  66% ] 15000/15000 VUs  2m18.1s/3m30.0s

running (2m18.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  66% ] 15000/15000 VUs  2m19.1s/3m30.0s

running (2m19.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  67% ] 15000/15000 VUs  2m20.1s/3m30.0s

running (2m20.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  67% ] 15000/15000 VUs  2m21.1s/3m30.0s

running (2m21.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  68% ] 15000/15000 VUs  2m22.1s/3m30.0s

running (2m22.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  68% ] 15000/15000 VUs  2m23.1s/3m30.0s

running (2m23.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  69% ] 15000/15000 VUs  2m24.1s/3m30.0s

running (2m24.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  69% ] 15000/15000 VUs  2m25.1s/3m30.0s

running (2m25.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  70% ] 15000/15000 VUs  2m26.1s/3m30.0s

running (2m26.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  70% ] 15000/15000 VUs  2m27.1s/3m30.0s

running (2m27.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  71% ] 15000/15000 VUs  2m28.1s/3m30.0s

running (2m28.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  71% ] 15000/15000 VUs  2m29.1s/3m30.0s

running (2m29.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  71% ] 15000/15000 VUs  2m30.1s/3m30.0s

running (2m30.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  72% ] 15000/15000 VUs  2m31.1s/3m30.0s

running (2m31.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  72% ] 15000/15000 VUs  2m32.1s/3m30.0s

running (2m32.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  73% ] 15000/15000 VUs  2m33.1s/3m30.0s

running (2m33.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  73% ] 15000/15000 VUs  2m34.1s/3m30.0s

running (2m34.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  74% ] 15000/15000 VUs  2m35.1s/3m30.0s

running (2m35.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  74% ] 15000/15000 VUs  2m36.1s/3m30.0s

running (2m36.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  75% ] 15000/15000 VUs  2m37.1s/3m30.0s

running (2m37.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  75% ] 15000/15000 VUs  2m38.1s/3m30.0s

running (2m38.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  76% ] 15000/15000 VUs  2m39.1s/3m30.0s

running (2m39.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  76% ] 15000/15000 VUs  2m40.1s/3m30.0s

running (2m40.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  77% ] 15000/15000 VUs  2m41.1s/3m30.0s

running (2m41.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  77% ] 15000/15000 VUs  2m42.1s/3m30.0s

running (2m42.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  78% ] 15000/15000 VUs  2m43.1s/3m30.0s

running (2m43.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  78% ] 15000/15000 VUs  2m44.1s/3m30.0s

running (2m44.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  79% ] 15000/15000 VUs  2m45.1s/3m30.0s

running (2m45.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  79% ] 15000/15000 VUs  2m46.1s/3m30.0s

running (2m46.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  80% ] 15000/15000 VUs  2m47.1s/3m30.0s

running (2m47.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  80% ] 15000/15000 VUs  2m48.1s/3m30.0s

running (2m48.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  81% ] 15000/15000 VUs  2m49.1s/3m30.0s

running (2m49.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  81% ] 15000/15000 VUs  2m50.1s/3m30.0s

running (2m50.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  81% ] 15000/15000 VUs  2m51.1s/3m30.0s

running (2m51.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  82% ] 15000/15000 VUs  2m52.1s/3m30.0s

running (2m52.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  82% ] 15000/15000 VUs  2m53.1s/3m30.0s

running (2m53.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  83% ] 15000/15000 VUs  2m54.1s/3m30.0s

running (2m54.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  83% ] 15000/15000 VUs  2m55.1s/3m30.0s

running (2m55.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  84% ] 15000/15000 VUs  2m56.1s/3m30.0s

running (2m56.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  84% ] 15000/15000 VUs  2m57.1s/3m30.0s

running (2m57.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  85% ] 15000/15000 VUs  2m58.1s/3m30.0s

running (2m58.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  85% ] 15000/15000 VUs  2m59.1s/3m30.0s

running (2m59.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  86% ] 15000/15000 VUs  3m00.1s/3m30.0s

running (3m00.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  86% ] 15000/15000 VUs  3m01.1s/3m30.0s

running (3m01.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  87% ] 15000/15000 VUs  3m02.1s/3m30.0s

running (3m02.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  87% ] 15000/15000 VUs  3m03.1s/3m30.0s

running (3m03.7s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  88% ] 15000/15000 VUs  3m04.1s/3m30.0s

running (3m04.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  88% ] 15000/15000 VUs  3m05.1s/3m30.0s

running (3m05.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  89% ] 15000/15000 VUs  3m06.1s/3m30.0s

running (3m06.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  89% ] 15000/15000 VUs  3m07.1s/3m30.0s

running (3m07.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  90% ] 15000/15000 VUs  3m08.1s/3m30.0s

running (3m08.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  90% ] 15000/15000 VUs  3m09.1s/3m30.0s

running (3m09.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  91% ] 15000/15000 VUs  3m10.1s/3m30.0s

running (3m10.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  91% ] 15000/15000 VUs  3m11.1s/3m30.0s

running (3m11.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  91% ] 15000/15000 VUs  3m12.1s/3m30.0s

running (3m12.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  92% ] 15000/15000 VUs  3m13.1s/3m30.0s

running (3m13.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  92% ] 15000/15000 VUs  3m14.1s/3m30.0s

running (3m14.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  93% ] 15000/15000 VUs  3m15.1s/3m30.0s

running (3m15.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  93% ] 15000/15000 VUs  3m16.1s/3m30.0s

running (3m16.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  94% ] 15000/15000 VUs  3m17.1s/3m30.0s

running (3m17.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  94% ] 15000/15000 VUs  3m18.1s/3m30.0s

running (3m18.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  95% ] 15000/15000 VUs  3m19.1s/3m30.0s

running (3m19.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  95% ] 15000/15000 VUs  3m20.1s/3m30.0s

running (3m20.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  96% ] 15000/15000 VUs  3m21.1s/3m30.0s

running (3m21.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  96% ] 15000/15000 VUs  3m22.1s/3m30.0s

running (3m22.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  97% ] 15000/15000 VUs  3m23.1s/3m30.0s

running (3m23.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  97% ] 15000/15000 VUs  3m24.1s/3m30.0s

running (3m24.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  98% ] 15000/15000 VUs  3m25.1s/3m30.0s

running (3m25.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  98% ] 15000/15000 VUs  3m26.1s/3m30.0s

running (3m26.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  99% ] 15000/15000 VUs  3m27.1s/3m30.0s

running (3m27.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [  99% ] 15000/15000 VUs  3m28.1s/3m30.0s

running (3m28.6s), 15000/15000 VUs, 11 complete and 0 interrupted iterations
sharded_room   [ 100% ] 15000/15000 VUs  3m29.1s/3m30.0s

running (3m29.6s), 14930/15000 VUs, 11 complete and 70 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m30.6s), 14429/15000 VUs, 11 complete and 571 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m31.6s), 13929/15000 VUs, 11 complete and 1071 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m32.6s), 13430/15000 VUs, 11 complete and 1570 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m33.6s), 12930/15000 VUs, 11 complete and 2070 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m34.5s), 12429/15000 VUs, 11 complete and 2571 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m35.5s), 11930/15000 VUs, 11 complete and 3070 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m36.5s), 11429/15000 VUs, 11 complete and 3571 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m37.5s), 10929/15000 VUs, 11 complete and 4071 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m38.5s), 10429/15000 VUs, 11 complete and 4571 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m39.5s), 09930/15000 VUs, 11 complete and 5070 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m40.5s), 09429/15000 VUs, 11 complete and 5571 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m41.5s), 08929/15000 VUs, 11 complete and 6071 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m42.5s), 08430/15000 VUs, 11 complete and 6570 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m43.5s), 07930/15000 VUs, 11 complete and 7070 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m44.5s), 07429/15000 VUs, 11 complete and 7571 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m45.5s), 06929/15000 VUs, 11 complete and 8071 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m46.5s), 06429/15000 VUs, 11 complete and 8571 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m47.5s), 05929/15000 VUs, 11 complete and 9071 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m48.5s), 05429/15000 VUs, 11 complete and 9571 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m49.5s), 04929/15000 VUs, 11 complete and 10071 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m50.5s), 04429/15000 VUs, 11 complete and 10571 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m51.5s), 03930/15000 VUs, 11 complete and 11070 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m52.5s), 03429/15000 VUs, 11 complete and 11571 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m53.5s), 02929/15000 VUs, 11 complete and 12071 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m54.4s), 02430/15000 VUs, 11 complete and 12570 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m55.4s), 01930/15000 VUs, 11 complete and 13070 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m56.4s), 01429/15000 VUs, 11 complete and 13571 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m57.4s), 00929/15000 VUs, 11 complete and 14071 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s

running (3m58.4s), 00429/15000 VUs, 11 complete and 14571 interrupted iterations
sharded_room ↓ [ 100% ] 15000/15000 VUs  3m30s


  █ THRESHOLDS 

    flock_ws_broadcast_latency
    ✓ 'p(95)<1000' p(95)=0s

    flock_ws_connect_duration
    ✓ 'p(95)<1000' p(95)=423ms

    flock_ws_receive_errors
    ✗ 'count==0' count=171


  █ TOTAL RESULTS 

    checks_total.......: 11      0.045965/s
    checks_succeeded...: 100.00% 11 out of 11
    checks_failed......: 0.00%   0 out of 11

    ✓ ws session connected

    CUSTOM
    flock_ws_broadcast_latency.....: avg=0s       min=0s           med=0s       max=0s       p(90)=0s       p(95)=0s      
    flock_ws_connect_duration......: avg=240.1ms  min=-100000000ns med=15ms     max=31.24s   p(90)=288ms    p(95)=423ms   
    flock_ws_receive_errors........: 171    0.714543/s
    flock_ws_rooms_joined..........: 30000  125.358461/s

    HTTP
    http_req_duration..............: avg=233.17ms min=233.17ms     med=233.17ms max=233.17ms p(90)=233.17ms p(95)=233.17ms
      { expected_response:true }...: avg=233.17ms min=233.17ms     med=233.17ms max=233.17ms p(90)=233.17ms p(95)=233.17ms
    http_req_failed................: 0.00%  0 out of 1
    http_reqs......................: 1      0.004179/s

    EXECUTION
    iteration_duration.............: avg=45.32s   min=45.17s       med=45.35s   max=45.4s    p(90)=45.39s   p(95)=45.4s   
    iterations.....................: 11     0.045965/s
    vus............................: 427    min=0        max=15000
    vus_max........................: 15000  min=1313     max=15000

    NETWORK
    data_received..................: 7.1 MB 30 kB/s
    data_sent......................: 8.6 MB 36 kB/s

    WEBSOCKET
    ws_connecting..................: avg=64.64ms  min=950.23µs     med=8.16ms   max=1s       p(90)=196.58ms p(95)=294.63ms
    ws_msgs_received...............: 139975 584.901686/s
    ws_msgs_sent...................: 154814 646.908159/s
    ws_session_duration............: avg=45.32s   min=45.17s       med=45.33s   max=45.4s    p(90)=45.39s   p(95)=45.4s   
    ws_sessions....................: 15011  62.725195/s



running (3m59.3s), 00000/15000 VUs, 11 complete and 15000 interrupted iterations
sharded_room ✓ [ 100% ] 00000/15000 VUs  3m30s
time="2026-06-22T03:34:50Z" level=error msg="thresholds on metrics 'flock_ws_receive_errors' have been crossed"